// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
function squareRect(a, b) {
    let s = a * b;
    console.log(s);
    return s;
}
squareRect(15, 10);

// - створити функцію яка обчислює та повертає площу кола з радіусом r
function squareCircle(r) {
    let s = 3.14 * r * r;
    console.log(s);
    return s;
}
squareCircle(10);

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
function squereCylinder(h, r) {
    let s = 2 * 3.14  * r * (h + r);
    console.log(Math.round(s));
    return s;
}
squereCylinder(12, 15);

// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість
// li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13